case/system/controlDict

    FoamFile
    {
        version     2.0;
        format      ascii;
        class       dictionary;
        location    "system";
        object      controlDict;
    }
    application     simpleFoam;

    startFrom       startTime;

    startTime       0;

    stopAt          endTime;

    endTime         10; // Adjust this as needed

    deltaT          5; // Increase this to speed up the simulation, but ensure stability

    writeControl    timeStep;

    writeInterval   10; // Adjust this to write results less frequently

    purgeWrite      0;

    writeFormat     ascii;

    writePrecision  6;

    writeCompression off;

    timeFormat      general;

    timePrecision   6;

    runTimeModifiable true;

    functions
    {
    }


// ************************************************************************* //
