case/system/blockMeshDict

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (5 0 -2.5)           // 0
    (3.535 3.535 -2.5)   // 1
    (0 5 -2.5)           // 2
    (-3.535 3.535 -2.5)  // 3
    (-5 0 -2.5)          // 4
    (-3.535 -3.535 -2.5) // 5
    (0 -5 -2.5)          // 6
    (3.535 -3.535 -2.5)  // 7
    (5 0 2.5)            // 8
    (3.535 3.535 2.5)    // 9
    (0 5 2.5)            // 10
    (-3.535 3.535 2.5)   // 11
    (-5 0 2.5)           // 12
    (-3.535 -3.535 2.5)  // 13
    (0 -5 2.5)           // 14
    (3.535 -3.535 2.5)   // 15
    (0 0 -2.5)           // 16 center bottom
    (0 0 2.5)            // 17 center top
);

blocks
(
    hex (16 0 1 2 17 8 9 10) (100 100 1) simpleGrading (1 1 1)
    hex (16 2 3 4 17 10 11 12) (100 100 1) simpleGrading (1 1 1)
    hex (16 4 5 6 17 12 13 14) (100 100 1) simpleGrading (1 1 1)
    hex (16 6 7 0 17 14 15 8) (100 100 1) simpleGrading (1 1 1)
);

edges
(
    arc 0 1 (4.265 1.765 -2.5)
    arc 1 2 (1.765 4.265 -2.5)
    arc 2 3 (-1.765 4.265 -2.5)
    arc 3 4 (-4.265 1.765 -2.5)
    arc 4 5 (-4.265 -1.765 -2.5)
    arc 5 6 (-1.765 -4.265 -2.5)
    arc 6 7 (1.765 -4.265 -2.5)
    arc 7 0 (4.265 -1.765 -2.5)
    
    arc 8 9 (4.265 1.765 2.5)
    arc 9 10 (1.765 4.265 2.5)
    arc 10 11 (-1.765 4.265 2.5)
    arc 11 12 (-4.265 1.765 2.5)
    arc 12 13 (-4.265 -1.765 2.5)
    arc 13 14 (-1.765 -4.265 2.5)
    arc 14 15 (1.765 -4.265 2.5)
    arc 15 8 (4.265 -1.765 2.5)
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
            (3 4 12 11)
            (4 5 13 12)
            (5 6 14 13)
            (6 7 15 14)
            (7 0 8 15)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (16 0 1 2)
            (16 2 3 4)
            (16 4 5 6)
            (16 6 7 0)
        );
    }
    top
    {
        type wall;
        faces
        (
            (17 8 9 10)
            (17 10 11 12)
            (17 12 13 14)
            (17 14 15 8)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
