case/system/snappyHexMeshDict

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;
geometry
{   
    propeller.stl
    {
        type            triSurfaceMesh;
        name            propeller;
    }
}

castellatedMeshControls
{
    maxLocalCells 1000000;
    maxGlobalCells 2000000;
    minRefinementCells 10;
    nCellsBetweenLevels 3;

    features
    (
        {
            file "propeller.eMesh";
            level 1;
        }
    );

    refinementSurfaces
    {
        propeller
        {
            level (2 2);
            regions
            {
                propellerPatch
                {
                    name propeller;
                    type wall;
                }
            }
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        propellerZone
        {
            mode inside;
            levels ((1e15 2));
        }
    }

    locationInMesh (0 0 0);  // Ensure this point is inside your mesh
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
}

addLayersControls
{
    relativeSizes true;
    layers { }

    expansionRatio 1.0;
    finalLayerThickness 0.3;
    minThickness 0.1;
    nGrow 0;
    featureAngle 60;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minFlatness 0.5;
    minVol 1e-13;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.05;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;
    minTetQuality 1e-15;
}

mergeTolerance 1E-6;

zones
{
    propellerZone
    {
        type cellZone;
        name propellerZone;
    }
}

// ************************************************************************* //
