case/constant/MRFProperties

    FoamFile
    {
        version     2.0;
        format      ascii;
        class       dictionary;
        object      MRFProperties;
    }

    MRFZones
    (
        propellerZone
        {
            cellZone    propellerZone; // Name of the cell zone from snappyHexMeshDict
            active      yes;
            nonRotatingPatches ();
            origin      (0 0 0); // Center of rotation, adjust as necessary
            axis        (0 0 1); // Axis of rotation
            omega       30; // Rotational speed in rad/s
        }
    );

    // ************************************************************************* //

