case/constant/physicalProperties

    FoamFile
    {
        version     2.0;
        format      ascii;
        class       dictionary;
        location    "system";
        object      snappyHexMeshDict;
    }
    castellatedMesh true;
    snap true;
    addLayers false;
    viscosityModel Newtonian;
    nu [0 2 -1 0 0 0 0] 1.5e-5;

    transport
    {
        nu [0 2 -1 0 0 0 0] 1.5e-5;
    }


    geometry
    {
        propeller.stl
        {
            type triSurfaceMesh;
            name propeller;
        }
    }

    castellatedMeshControls
    {
        maxLocalCells 1000000;
        maxGlobalCells 2000000;
        minRefinementCells 10;
        nCellsBetweenLevels 3;

        features
        (
            {
                file "propeller.eMesh";
                level 2;
            }
        );

        refinementSurfaces
        {
            propeller
            {
                level (4 4);
            }
        }

        resolveFeatureAngle 30;
    }

    snapControls
    {
        nSmoothPatch 3;
        tolerance 2.0;
        nSolveIter 30;
        nRelaxIter 5;
    }

    addLayersControls
    {
        relativeSizes true;
        layers
        {
            propeller
            {
                nSurfaceLayers 1;
            }
        }
        expansionRatio 1.0;
        finalLayerThickness 0.3;
        minThickness 0.25;
        nGrow 0;
        featureAngle 30;
        nRelaxIter 3;
        nSmoothSurfaceNormals 1;
        nSmoothNormals 3;
        nSmoothThickness 10;
        maxFaceThicknessRatio 0.5;
        maxThicknessToMedialRatio 0.3;
        minMedianAxisAngle 130;
        maxSkewness 4.0;
        maxBoundarySkewness 20;
        nBufferCellsNoExtrude 0;
        nLayerIter 50;
    }

    meshQualityControls
    {
        maxNonOrtho 65;
        maxBoundarySkewness 20;
        maxInternalSkewness 4;
        maxConcave 80;
        minFlatness 0.5;
        minVol 1e-13;
        minTetQuality 1e-9;
        minArea -1;
        minTwist 0.02;
        minDeterminant 0.001;
        minFaceWeight 0.02;
        minVolRatio 0.01;
        minTriangleTwist -1;
        nSmoothScale 4;
        errorReduction 0.75;
    }

    writeFlags (scalarLevels layerSets layerFields);

    mergeTolerance 1e-6;

