case/constant/thermophysicalProperties

    FoamFile
    {
        version     2.0;
        format      ascii;
        class       dictionary;
        location    "constant";
        object      thermophysicalProperties;
    }

    // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    thermoType
    {
        type            hePsiThermo;
        mixture         pureMixture;
        transport       sutherland;
        thermo          hConst;
        equationOfState perfectGas;
        specie          specie;
        energy          sensibleInternalEnergy;
    }

    mixture
    {
        specie
        {
            nMoles          1;
            molWeight       28.97;
        }
        equationOfState
        {
            R               287.058;
        }
        thermodynamics
        {
            Cp              1005;
            Hf              0;
        }
        transport
        {
            mu              1.8e-05;
            Pr              0.7;
        }
    }

    // ************************************************************************* //

