case/0/epsilon

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.01;
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    bottom
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    top
    {
        type            zeroGradient;
    }
    propeller
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }
}

// ************************************************************************* //
