case/0/k

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.01;
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
    bottom
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
    top
    {
        type            zeroGradient;
    }
    propeller
    {
        type            kqRWallFunction;
        value           uniform 0.005;
    }
}

// ************************************************************************* //
