case/0/nut

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-5;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 1e-5;
    }
    outlet
    {
        type            calculated;
        value           uniform 1e-5;
    }
    walls
    {
        type            nutkWallFunction;
        value           uniform 1e-5;
    }
    bottom
    {
        type            nutkWallFunction;
        value           uniform 1e-5;
    }
    top
    {
        type            calculated;
        value           uniform 1e-5;
    }
    propeller
    {
        type            nutkWallFunction;
        value           uniform 1e-5;
    }
}

// ************************************************************************* //
