case/system/surfaceFeaturesDict

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

propeller
{
    surfaces ("propeller.stl");
    includedAngle 120;
    
}

// ************************************************************************* //
